In [3]:
import pandas as pd
import sqlite3
db_conn = sqlite3.connect("capstone.db")
c = db_conn.cursor()

In [4]:
try:
    prods = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_product_dataset.csv?sp=r&st=2022-04-25T05:55:20Z&se=2022-05-31T13:55:20Z&spr=https&sv=2020-08-04&sr=b&sig=AM4Sqtl4sLSFH9hfi0xHiNVecP6SHGWBYWWBsBJ70tA%3D')
except:
    print("File not found in Azure blob storage")

In [5]:
prods.dtypes

product_id                    object
product_category_name         object
product_name_lenght            int64
product_description_lenght     int64
product_photos_qty             int64
product_weight_g               int64
product_length_cm              int64
product_height_cm              int64
product_width_cm               int64
dtype: object

In [6]:
c.execute(
    """
    CREATE TABLE prods(
        product_id TEXT,
        product_category_name TEXT ,
        product_name_lenght INTEGER,
        product_description_lenght INTEGER,
        product_photos_qty INTEGER,
        product_weight_g INTEGER,
        product_length_cm INTEGER,
        product_height_cm INTEGER,
        product_width_cm INTEGER
    );   
    """
)

OperationalError: table prods already exists

In [7]:
try:
    gloc = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_geolocation_dataset.csv?sp=r&st=2022-04-25T06:01:24Z&se=2022-05-31T14:01:24Z&spr=https&sv=2020-08-04&sr=b&sig=BMk90cElVCqnBrNLethZfIvXGwRH8rmWaY6rPACUDwg%3D')
except:
    print("File not found in Azure blob storage")

In [8]:
gloc.dtypes

geolocation_zip_code_prefix      int64
geolocation_lat                float64
geolocation_lng                float64
geolocation_city                object
geolocation_state               object
dtype: object

In [5]:
c.execute(
    """
    CREATE TABLE gloc(
        geolocation_zip_code_prefix INTEGER,
        geolocation_lat INTEGER,
        geolocation_lng INTEGER,
        geolocation_city TEXT,
        geolocation_state TEXT
    );   
    """
)

In [9]:
try:
    sellers = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_sellers_dataset.csv?sp=r&st=2022-04-25T06:02:38Z&se=2022-05-31T14:02:38Z&spr=https&sv=2020-08-04&sr=b&sig=KIH%2FSFCDHvFlOjr4nhE738QdxWYPWZaweodVqUPBWog%3D')
except:
    print("File not found in Azure blob storage")

In [10]:
sellers.dtypes

seller_id                 object
seller_zip_code_prefix     int64
seller_city               object
seller_state              object
dtype: object

In [30]:
c.execute(
    """
    CREATE TABLE sellers(
        seller_id TEXT,
        seller_zip_code_prefix INTEGER,
        seller_city TEXT,
        seller_state TEXT,
        FOREIGN KEY(seller_zip_code_prefix) REFERENCES gloc(geolocation_zip_code_prefix)
    );   
    """
)

In [11]:
try: 
    custs = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_customers_dataset.csv?sp=r&st=2022-04-25T06:03:12Z&se=2022-05-31T14:03:12Z&spr=https&sv=2020-08-04&sr=b&sig=vepqVJIKJzdp8kN1gFJKf52XZxDMk0ASSaJwhukkmWA%3D')
except:
    print("File not found in Azure blob storage")

In [12]:
custs.dtypes

customer_id                 object
customer_unique_id          object
customer_zip_code_prefix     int64
customer_city               object
customer_state              object
dtype: object

In [32]:
c.execute(
    """
    CREATE TABLE custs(
        customer_id TEXT,
        customer_unique_id TEXT,
        customer_zip_code_prefix INTEGER,
        customer_city TEXT,
        customer_state TEXT,
        FOREIGN KEY(customer_zip_code_prefix) REFERENCES gloc(geolocation_zip_code_prefix)
    );   
    """
)

In [13]:
try:
    prod_cat = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/product_category_name_translation.csv?sp=r&st=2022-04-25T06:04:05Z&se=2022-05-31T14:04:05Z&spr=https&sv=2020-08-04&sr=b&sig=jvCp7RcTn1XqN03A8LTzyRZqS%2BTJlZSQlp25KKJz0Tg%3D')
except:
    print("File not found in Azure blob storage")

In [14]:
prod_cat.dtypes

product_category_name            object
product_category_name_english    object
dtype: object

In [11]:
c.execute(
    """
    CREATE TABLE prod_cat(
        product_category_name TEXT,
        product_category_name_english TEXT,
        FOREIGN KEY(product_category_name) REFERENCES prod(product_category_name)
    );   
    """
)

In [15]:
try:
    orders = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_orders_dataset.csv?sp=r&st=2022-04-25T06:04:39Z&se=2022-05-31T14:04:39Z&spr=https&sv=2020-08-04&sr=b&sig=IeQCiHqObX%2FckTEqrdJtzkHymMUnc4RL5%2FJEEDd4GQM%3D')
except:
    print("File not found in Azure blob storage")

In [16]:
orders.dtypes

order_id                         object
customer_id                      object
order_status                     object
order_purchase_timestamp         object
order_approved_at                object
order_delivered_carrier_date     object
order_delivered_customer_date    object
order_estimated_delivery_date    object
dtype: object

In [34]:
c.execute(
    """
    CREATE TABLE orders(
        order_id TEXT,
        customer_id TEXT,
        order_status TEXT,
        order_purchase_timestamp TEXT,
        order_approved_at TEXT,
        order_delivered_carrier_date TEXT,
        order_delivered_customer_date TEXT,
        order_estimated_delivery_date TEXT,
        FOREIGN KEY(customer_id) REFERENCES cust(customer_id)
    );   
    """
)

In [17]:
try:
    ord_pay = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_order_payments_dataset.csv?sp=r&st=2022-04-25T06:05:22Z&se=2022-05-31T14:05:22Z&spr=https&sv=2020-08-04&sr=b&sig=qL7TWU9XHhJmTfn7R%2B%2BkZvlDN0bc1nQd3hY1OZJ0%2FZY%3D')
except:
    print("File not found in Azure blob storage")

In [18]:
ord_pay.dtypes

order_id                 object
payment_sequential        int64
payment_type             object
payment_installments      int64
payment_value           float64
dtype: object

In [15]:
c.execute(
    """
    CREATE TABLE ord_pay(
        order_id TEXT,
        payment_sequential INTEGER,
        payment_type TEXT,
        payment_installments INTEGER,
        payment_value INTEGER,
        FOREIGN KEY(order_id) REFERENCES ords(order_id)
    );   
    """
)

In [19]:
try:
    ord_itms = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_order_items_dataset.csv?sp=r&st=2022-04-25T06:07:32Z&se=2022-05-31T14:07:32Z&spr=https&sv=2020-08-04&sr=b&sig=SIEuwKW%2Fxg%2BHHZpIjGZRodn3GMI6z0jssOEGF%2FIEqK8%3D')
except:
    print("File not found in Azure blob storage")

In [20]:
ord_itms.dtypes

order_id                object
order_item_id            int64
product_id              object
seller_id               object
shipping_limit_date     object
price                  float64
freight_value          float64
dtype: object

In [17]:
c.execute(
    """
    CREATE TABLE ord_itms(
        order_id TEXT,
        order_item_id INTEGER,
        product_id TEXT,
        seller_id TEXT,
        shipping_limit_date TEXT,
        price INTEGER,
        freight_value INTEGER,
        FOREIGN KEY(order_id) REFERENCES ords(order_id),
        FOREIGN KEY(product_id) REFERENCES product(product_id),
        FOREIGN KEY(seller_id) REFERENCES sellers(seller_id)
    );   
    """
)

In [21]:
try:
    ord_revs = pd.read_csv('https://capstone48.blob.core.windows.net/capstone/olist_order_reviews_dataset.csv?sp=r&st=2022-04-25T06:08:20Z&se=2022-05-31T14:08:20Z&spr=https&sv=2020-08-04&sr=b&sig=hVuV%2BB%2BZuIqpBx%2FXqnYMS2F5%2F5IPdZST%2Fbz3KkEYadE%3D')
except:
    print("File not found in Azure blob storage")

In [23]:
ord_revs.dtypes

review_id                  object
order_id                   object
review_score                int64
review_comment_title       object
review_comment_message     object
review_creation_date       object
review_answer_timestamp    object
dtype: object

In [22]:
c.execute(
    """
    CREATE TABLE ord_revs(
        review_id TEXT,
        order_id TEXT,
        review_score INTEGER,
        review_comment_title TEXT,
        review_comment_message TEXT,
        order_approved_at TEXT,
        review_creation_date TEXT,
        review_answer_timestamp TEXT,
        FOREIGN KEY(order_id) REFERENCES ords(order_id)
    );   
    """
)

In [24]:
prods.to_sql('prods', db_conn, if_exists='append', index=False)
gloc.to_sql('gloc', db_conn, if_exists='append', index=False)
sellers.to_sql('sellers', db_conn, if_exists='append', index=False)
custs.to_sql('custs', db_conn, if_exists='append', index=False)
prod_cat.to_sql('prod_cat', db_conn, if_exists='append', index=False)
orders.to_sql('orders', db_conn, if_exists='append', index=False)
ord_pay.to_sql('ord_pay', db_conn, if_exists='append', index=False)
ord_itms.to_sql('ord_itms', db_conn, if_exists='append', index=False)
ord_revs.to_sql('ord_revs', db_conn, if_exists='append', index=False)

Find out top selling products

In [25]:
pd.read_sql("SELECT count(*) as total_count, pc.product_category_name_english as top_product FROM prods p, prod_cat pc ON pc.product_category_name=p.product_category_name GROUP BY p.product_category_name ORDER BY total_count desc LIMIT 10",db_conn)

   total_count            top_product
0        27261         bed_bath_table
1        25803         sports_leisure
2        23913        furniture_decor
3        21996          health_beauty
4        21015             housewares
5        17100                   auto
6        14751  computers_accessories
7        12699                   toys
8        11961          watches_gifts
9        10206              telephony

Total revenue generated between two dates

In [26]:
pd.read_sql("SELECT sum(op.payment_value) as total_revenue FROM ord_pay op, orders ord ON op.order_id=ord.order_id WHERE ord.order_delivered_customer_date BETWEEN '2017-10-10' AND '2017-10-20'",db_conn)

   total_revenue
0      1612595.4

Total orders by product category

In [27]:
pd.read_sql("SELECT count(*) as total_orders,pc.product_category_name_english as product_category FROM ord_itms oi, prods p, prod_cat pc ON oi.product_id=p.product_id AND p.product_category_name=pc.product_category_name GROUP BY p.product_category_name ORDER BY total_orders DESC",db_conn)

    total_orders           product_category
0         300105             bed_bath_table
1         261090              health_beauty
2         233307             sports_leisure
3         225018            furniture_decor
4         211329      computers_accessories
..           ...                        ...
66           648      arts_and_craftmanship
67           378                 la_cuisine
68           378          cds_dvds_musicals
69           216  fashion_childrens_clothes
70            54      security_and_services

[71 rows x 2 columns]

Count total number of customers by each region

In [28]:
pd.read_sql("SELECT count(*) as total_customers, customer_city as Region FROM custs GROUP BY customer_city ORDER BY total_customers DESC",db_conn)

      total_customers          Region
0               31080       sao paulo
1               13764  rio de janeiro
2                5546  belo horizonte
3                4262        brasilia
4                3042        curitiba
...               ...             ...
4114                2         acucena
4115                2           acari
4116                2       acajutiba
4117                2   abdon batista
4118                2       abadiania

[4119 rows x 2 columns]

Find revenue generated annually

In [29]:
pd.read_sql("SELECT sum(op.payment_value) as total_revenue, strftime('%Y', ord.order_estimated_delivery_date) as year FROM orders ord, ord_pay op ON ord.order_id=op.order_id GROUP BY strftime('%Y', ord.order_estimated_delivery_date)",db_conn)

   total_revenue  year
0   3.515932e+05  2016
1   3.894239e+07  2017
2   5.675925e+07  2018

Find the most valued customers and salesmen

In [30]:
pd.read_sql("SELECT max(op.payment_value) as value, c.customer_id as valued_customer FROM ord_pay op, custs c, orders ord ON c.customer_id=ord.customer_id AND ord.order_id=op.order_id",db_conn)

      value                   valued_customer
0  13664.08  1617b1357756262bfa56ab541c47bc16

In [31]:
pd.read_sql("SELECT max(op.payment_value) as value, s.seller_id as valued_salesman FROM ord_pay op, sellers s, ord_itms oi ON s.seller_id=oi.seller_id AND oi.order_id=op.order_id",db_conn)

      value                   valued_salesman
0  13664.08  b37c4c02bda3161a7546a4e6d222d5b2

Total orders by regions/city

In [32]:
pd.read_sql("SELECT count(*) as total_orders, c.customer_city as Region FROM custs c, orders o ON o.customer_id=c.customer_id GROUP BY c.customer_city ORDER BY total_orders DESC",db_conn)

      total_orders          Region
0            62160       sao paulo
1            27528  rio de janeiro
2            11092  belo horizonte
3             8524        brasilia
4             6084        curitiba
...            ...             ...
4114             4         acucena
4115             4           acari
4116             4       acajutiba
4117             4   abdon batista
4118             4       abadiania

[4119 rows x 2 columns]

Most reviewed product

In [33]:
pd.read_sql("SELECT count(*) as num_of_reviews, pc.product_category_name_english as most_reviewed_product FROM prod_cat pc, ord_itms oi, prods p ON p.product_id=oi.product_id AND p.product_category_name=pc.product_category_name GROUP BY p.product_category_name ORDER BY num_of_reviews DESC LIMIT 1",db_conn)

   num_of_reviews most_reviewed_product
0          300105        bed_bath_table

Find min and max priced products

In [34]:
pd.read_sql("SELECT pc.product_category_name_english as Product, max(op.payment_value) as Value FROM ord_pay op, prods p, prod_cat pc,ord_itms oi ON p.product_category_name=pc.product_category_name_english AND p.product_id=oi.product_id AND oi.order_id=op.order_id UNION SELECT pc.product_category_name_english as Product, min(op.payment_value) as Value FROM ord_pay op, prods p, prod_cat pc,ord_itms oi ON p.product_category_name=pc.product_category_name_english AND p.product_id=oi.product_id AND oi.order_id=op.order_id",db_conn)

          Product    Value
0  consoles_games     0.00
1      cool_stuff  4809.44

Product sales over time(scope of particular product day by day)

In [35]:
pd.read_sql("SELECT strftime('%d %m %Y', ord.order_purchase_timestamp) as Day, count(oi.product_id) as Total_sales FROM prods p, prod_cat pc, orders ord, ord_itms oi ON oi.order_id=ord.order_id AND oi.product_id=p.product_id AND p.product_category_name=pc.product_category_name WHERE pc.product_category_name_english='toys' GROUP BY Day",db_conn)

            Day  Total_sales
0    01 01 2018          108
1    01 02 2017          162
2    01 02 2018          216
3    01 03 2017          378
4    01 03 2018          378
..          ...          ...
585  31 07 2017          540
586  31 07 2018          216
587  31 08 2017          270
588  31 10 2017          216
589  31 12 2017          270

[590 rows x 2 columns]

Show how many orders have been placed by how many customers

In [36]:
pd.read_sql("SELECT c.customer_id as Customer, count(op.order_id) as Num_orders FROM custs c, orders ord, ord_pay op ON op.order_id=ord.order_id AND c.customer_id=ord.customer_id GROUP BY Customer",db_conn)

                               Customer  Num_orders
0      00012a2ce6f8dcda20d059ce98491703          12
1      000161a058600d5901f007fab4c27140          12
2      0001fd6190edaaf884bcaf3d49edf079          12
3      0002414f95344307404f0ace7a26f1d5          12
4      000379cdec625522490c315e70c7a9fb          12
...                                 ...         ...
99435  fffecc9f79fd8c764f843e9951b11341          36
99436  fffeda5b6d849fbd39689bb92087f431          12
99437  ffff42319e9b2d713724ae527742af25          12
99438  ffffa3172527f765de70084a7e53aae8          12
99439  ffffe8b65bbe3087b653a978c870db99          12

[99440 rows x 2 columns]

In [37]:
import time
from datetime import datetime, date, time, timedelta
import dateutil.relativedelta

Calculate shipment aging for each order

In [38]:
pd.read_sql("SELECT order_id, Cast((JulianDay(order_estimated_delivery_date) - JulianDay(order_purchase_timestamp) +1) As Integer) as Shipment_age FROM orders",db_conn)

                                order_id  Shipment_age
0       e481f51cbdc54678b7cc49136f2d6af7            16
1       53cdb2fc8bc7dce0b6741e2150273451            20
2       47770eb9100c2d0c44946d9cf07ec65d            27
3       949d5b44dbf5de918fe9c16f97b45f8a            27
4       ad21c59c0840e6cb83a9ceb5573f8159            13
...                                  ...           ...
198877  9c5dedf39a927c1b2549525ed64a053c            19
198878  63943bddc261676b46f01ca7ac2f7bd8            24
198879  83c1379a015df1e13d02aae0204711ab            31
198880  11c177c8e97725db2631073c19f07b62            38
198881  66dea50a8b16d9b4dee7af250b4be1a5            26

[198882 rows x 2 columns]